{
  "backend/main.mo": "Defines sports, betting, subscription, and user-profile types, initializes maps for predictions and user data, and sets up authorization and Stripe config.",
  "feature_evidence.json": "Feature evidence report linking a navigation update to its related file, components, and requirement ID.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across components, pages, and utilities.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables, light/dark mode values, and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes and wraps the app in ThemeProvider and AppLayout.",
  "frontend/src/components/AccountProfileEditor.tsx": "Profile edit form allowing users to update name and email with backend mutation and validation.",
  "frontend/src/components/AdminGate.tsx": "Admin-only access wrapper that checks admin status and blocks unauthorized users with an error screen.",
  "frontend/src/components/AppFooter.tsx": "Footer with app info, navigation links, social icons, and attribution to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation links, mobile menu, login button, and admin/user-specific options.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with header/footer and triggers profile setup modal for new authenticated users.",
  "frontend/src/components/DabbleFormatCard.tsx": "Displays prediction data in a formatted block for manual Dabble entry and provides copy-to-clipboard functionality.",
  "frontend/src/components/HeroBranding.tsx": "Hero section with branding, background visuals, and marketing text for the homepage.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout using Internet Identity with loading states and error handling.",
  "frontend/src/components/ManualPremiumGrantCard.tsx": "Admin card to grant permanent premium access by entering a user's principal ID.",
  "frontend/src/components/PredictionsFilters.tsx": "Filter controls for selecting sport type and sort order on predictions lists.",
  "frontend/src/components/PremiumGate.tsx": "Restricts premium content based on authentication, subscription, or admin status with optional preview.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to set up a profile with name and optional email.",
  "frontend/src/components/RedeemReferralCodeCard.tsx": "Allows users to redeem referral codes for premium access with error handling.",
  "frontend/src/components/ReferralCodesAdminPanel.tsx": "Admin panel to create, list, copy, and revoke referral codes with duration handling and toast feedback.",
  "frontend/src/components/ResponsibleGamblingDisclaimer.tsx": "Displays a disclaimer alert warning users about predictive accuracy and promoting responsible gambling.",
  "frontend/src/components/StripePaymentSetup.tsx": "Form for admins to configure Stripe secret key and allowed countries, saving settings via mutation.",
  "frontend/src/components/SubscribeCta.tsx": "Promotional CTA encouraging users to view pricing and subscribe for premium predictions.",
  "frontend/src/components/TermsAcceptanceGate.tsx": "Gates content until users accept terms of service, storing acceptance and showing a summary and checkbox UI.",
  "frontend/src/hooks/useActivateSubscription.ts": "Mutation hook that activates a subscription and refreshes related user and premium status queries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations for predictions and data inputs like depth charts and injuries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and status handling.",
  "frontend/src/hooks/useManualPremiumGrant.ts": "Provides a mutation to manually grant premium access to a user and invalidates subscription-related queries on success.",
  "frontend/src/hooks/useQueries.ts": "Defines queries for fetching predictions, including all predictions, by sport, and by ID using the actor API.",
  "frontend/src/hooks/useReferralCodes.ts": "Contains admin and user hooks for listing, creating, revoking, and redeeming referral codes with appropriate query invalidations.",
  "frontend/src/hooks/useRestorePremiumAccess.ts": "Implements a mutation that refreshes subscription, profile, and premium status queries by invalidating and refetching them.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides hooks for creating Stripe checkout sessions, checking Stripe configuration, and saving Stripe settings.",
  "frontend/src/hooks/useSubscription.ts": "Aggregates subscription, profile, and premium status queries and derives active access state and subscription details.",
  "frontend/src/hooks/useUserProfile.ts": "Includes hooks for fetching and updating the caller’s user profile, with automatic query invalidation on updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, gradients, and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and Internet Identity providers and rendering the root component.",
  "frontend/src/pages/AccountPage.tsx": "Renders the user account page with profile info, subscription status, admin access, and premium restoration logic.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard with tabs for Stripe setup, referral codes, manual premium grants, and data-entry tools for predictions and content.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing feature highlights, pricing preview, and branding components with navigation support.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post-payment flow including subscription activation, authentication checks, and status messaging.",
  "frontend/src/pages/PredictionDetailPage.tsx": "Loads and displays detailed information for a single prediction with metadata, risk tier, and navigation.",
  "frontend/src/pages/PredictionsPage.tsx": "Lists all predictions with sorting, filtering, risk indicators, and premium gating.",
  "frontend/src/pages/PricingPage.tsx": "Shows subscription plans, validates user readiness, and initiates Stripe checkout sessions.",
  "frontend/src/pages/SendSupportPage.tsx": "Renders a support page showing a Cash App cashtag and link with copy-to-clipboard and external-open buttons.",
  "frontend/src/pages/TermsPage.tsx": "Displays the Terms of Service with scrollable content and manages acceptance state persisted in local storage.",
  "frontend/src/utils/riskTier.ts": "Maps a prediction’s winning probability to a risk tier object containing labels, colors, and descriptions.",
  "frontend/src/utils/termsAcceptance.ts": "Handles reading, writing, and clearing a stored terms-acceptance flag in localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, container settings, and theme extensions.",
  "project_state.json": "Describes the project’s state, goals, features, and architectural constraints for the CashPicks app."
}