{
  "backend/main.mo": "Defines sports, betting, subscription, referral, and user profile types, sets up persistent state maps, and includes authorization and Stripe config scaffolding.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for many frontend files to aid build planning.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global background/foreground rules.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in ThemeProvider with toast support.",
  "frontend/src/components/AccountProfileEditor.tsx": "Form component allowing users to edit and save their name and email with backend integration.",
  "frontend/src/components/AdminGate.tsx": "Wrapper that checks admin status and shows a denial screen for non‑admins.",
  "frontend/src/components/AdminSupportCard.tsx": "UI card for admins to look up a user's premium status by principal ID and display diagnostic details.",
  "frontend/src/components/AppFooter.tsx": "Footer with branding, navigation links, social icons, and a dynamic year.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation, login button, admin links, and a mobile-responsive menu.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapping header, footer, and profile-setup modal shown for new authenticated users.",
  "frontend/src/components/DabbleFormatCard.tsx": "Formats a prediction into a copyable text block for manual entry on Dabble.",
  "frontend/src/components/HeroBranding.tsx": "Hero section with branding, background patterns, and marketing headline.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/ManualPremiumGrantCard.tsx": "Admin card to grant or revoke manual premium access by entering a user's principal ID.",
  "frontend/src/components/PredictionsFilters.tsx": "Provides sport and sort-order dropdown filters for predictions using Select components.",
  "frontend/src/components/PremiumGate.tsx": "Gates premium content based on authentication and subscription status, showing loaders, prompts, or content accordingly.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name and optional email, submitting via useUpdateUserProfile.",
  "frontend/src/components/RedeemReferralCodeCard.tsx": "Card allowing users to enter and redeem referral codes with validation and error handling.",
  "frontend/src/components/ReferralCodesAdminPanel.tsx": "Admin panel to create, list, copy, and revoke referral codes, including duration handling and status display.",
  "frontend/src/components/ResponsibleGamblingDisclaimer.tsx": "Displays an informational disclaimer about prediction accuracy and responsible gambling.",
  "frontend/src/components/StripePaymentSetup.tsx": "Form for configuring Stripe secret key and allowed countries using useSetStripeConfiguration.",
  "frontend/src/components/SubscribeCta.tsx": "Promotional CTA encouraging users to view pricing and subscribe for premium predictions.",
  "frontend/src/components/TermsAcceptanceGate.tsx": "Gates content until the user accepts terms of service, storing acceptance and showing a summary and checkbox.",
  "frontend/src/hooks/useActivateSubscription.ts": "Provides a mutation to activate a subscription and refresh related queries for immediate UI updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin utilities for checking admin status and mutating depth charts, reports, news flags, coaching styles, and predictions.",
  "frontend/src/hooks/useAdminPremiumDiagnosis.ts": "Fetches premium-diagnosis data for a target principal with admin-only access and specific error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via a React context provider.",
  "frontend/src/hooks/useManualPremiumGrant.ts": "Mutation to manually grant premium status to a user and invalidate related subscription and diagnosis queries.",
  "frontend/src/hooks/useManualPremiumRevoke.ts": "Mutation to revoke manually granted premium access and refresh subscription and diagnosis data.",
  "frontend/src/hooks/useQueries.ts": "Provides queries to fetch predictions globally, by sport, or by ID using the backend actor.",
  "frontend/src/hooks/useReferralCodes.ts": "Handles listing, creating, revoking, and redeeming referral codes with appropriate query invalidation.",
  "frontend/src/hooks/useRestorePremiumAccess.ts": "Forces refresh of all premium-related queries without calling the backend.",
  "frontend/src/hooks/useStripeCheckout.ts": "Supports creating Stripe checkout sessions, checking configuration, and updating Stripe settings.",
  "frontend/src/hooks/useSubscription.ts": "Aggregates subscription, profile, and premium-source queries and derives access states and helpers.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates the caller's user profile with identity-aware loading and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers, extensive CSS variables for light/dark themes, global layout resets, gradient backgrounds, and utility classes for custom cash-themed colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AccountPage.tsx": "Displays user account details, premium status, subscription info, and admin tools, handling authentication, loading states, and access restoration.",
  "frontend/src/pages/AdminPage.tsx": "Provides an admin interface with tabs for Stripe setup, referral codes, manual grants, and editing sports-related data via various mutation hooks.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with feature highlights, pricing intro, and hero branding.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to retry subscription or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes subscription activation via URL/session parameters, handling authentication, activation state, error messaging, and redirects.",
  "frontend/src/pages/PredictionDetailPage.tsx": "Displays a detailed view of a single prediction, including confidence, sport, market, dates, and risk tier, with loading and error handling.",
  "frontend/src/pages/PredictionsPage.tsx": "Shows a list of predictions with filtering, sorting, risk tiers, and basic metadata, handling loading and empty states.",
  "frontend/src/pages/PricingPage.tsx": "Provides subscription plan options, validates identity and terms acceptance, and initiates Stripe checkout sessions.",
  "frontend/src/pages/SendSupportPage.tsx": "Allows users to copy or open a Cash App link to send support, showing cashtag details and UI interactions.",
  "frontend/src/pages/TermsPage.tsx": "Displays Terms of Service content and manages acceptance state stored in localStorage.",
  "frontend/src/utils/riskTier.ts": "Calculates a prediction’s risk tier based on winning probability and returns tier metadata.",
  "frontend/src/utils/termsAcceptance.ts": "Reads, writes, and clears terms acceptance status from localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, store/retrieve them in sessionStorage, and sync URL values for persistence.",
  "frontend/tailwind.config.js": "Defines the Tailwind CSS setup with custom colors, typography, animations, and container settings for the app theme.",
  "project_state.json": "Stores project state, requirements, architecture notes, and known issues for the app’s build and planning workflow."
}