{
  "backend/main.mo": "Motoko canister defining sports types, predictions, user profiles, subscriptions, referrals, and persistent state with access control helpers.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to modified frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and pages.",
  "frontend/index.css": "Tailwind base/theme variable definitions establishing light and dark mode color tokens for the app.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps app in AppLayout and ThemeProvider, and defines all page routes including support and terms.",
  "frontend/src/components/AccountProfileEditor.tsx": "Profile editing card allowing users to update name and email with validation and backend mutation.",
  "frontend/src/components/AdminGate.tsx": "Gate component that checks admin status and shows loading or access denied screens when appropriate.",
  "frontend/src/components/AppFooter.tsx": "Footer with navigation links, social icons, and attribution, styled with cash‑themed accents.",
  "frontend/src/components/AppHeader.tsx": "Navigation header with links, auth-based items, mobile menu, and login button.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with header/footer and shows a profile setup modal when a logged‑in user lacks a profile.",
  "frontend/src/components/DabbleFormatCard.tsx": "Displays a formatted betting summary for a prediction and provides copy‑to‑clipboard functionality.",
  "frontend/src/components/HeroBranding.tsx": "Hero section with branding graphics, headline, and description for the landing page.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout via Internet Identity and updates query state accordingly.",
  "frontend/src/components/PredictionsFilters.tsx": "Filter controls for selecting sport and sort order on predictions pages.",
  "frontend/src/components/PremiumGate.tsx": "Gates premium content based on authentication and subscription status, showing CTAs or previews.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter name and optional email to create their profile.",
  "frontend/src/components/RedeemReferralCodeCard.tsx": "Card for entering and submitting referral codes, with error handling and success messaging.",
  "frontend/src/components/ReferralCodesAdminPanel.tsx": "Admin UI for creating, listing, copying, and revoking referral codes with duration input and async mutations.",
  "frontend/src/components/ResponsibleGamblingDisclaimer.tsx": "Displays a disclaimer warning about betting risks and accuracy limitations of predictions.",
  "frontend/src/components/StripePaymentSetup.tsx": "Form interface for saving Stripe secret key and allowed countries via a backend mutation.",
  "frontend/src/components/SubscribeCta.tsx": "Promotional CTA encouraging users to view pricing and subscribe to premium prediction features.",
  "frontend/src/components/TermsAcceptanceGate.tsx": "Gate component that blocks content until users accept Terms of Service, storing acceptance and handling navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing access control and refetching dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations for setting data fields and creating predictions using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, loading identities, and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch predictions, including all predictions, by sport, and by ID using an actor API.",
  "frontend/src/hooks/useReferralCodes.ts": "Defines React Query hooks for admins to manage referral codes and for users to redeem them, with automatic cache invalidation.",
  "frontend/src/hooks/useStripeCheckout.ts": "Implements hooks to create Stripe checkout sessions, check Stripe configuration, and update Stripe settings via the actor.",
  "frontend/src/hooks/useSubscription.ts": "Fetches subscription and referral status, computes active access, and exposes loading and status fields.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the caller’s user profile with cache refreshing.",
  "frontend/src/index.css": "Global TailwindCSS configuration defining themes, color tokens, gradients, and utility classes for styling.",
  "frontend/src/main.tsx": "Entry point that initializes React, sets up the QueryClient, and wraps the app with Internet Identity and React Query providers.",
  "frontend/src/pages/AccountPage.tsx": "Account page showing profile data, principal ID, subscription and referral status, with loading and auth handling.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for Stripe setup and managing depth charts, injuries, coaching styles, news flags, and predictions using various mutation hooks.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing branding, feature highlights, and pricing preview for CashPicks. Uses cards and icons to present service benefits and navigation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry subscribing or return home. Provides simple navigation and status indication.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows confirmation of a successful subscription payment and offers navigation to predictions or account. Triggers a toast notification on load.",
  "frontend/src/pages/PredictionDetailPage.tsx": "Fetches and displays detailed prediction info including sport, market, confidence, and risk tier. Handles loading, errors, and gated premium content.",
  "frontend/src/pages/PredictionsPage.tsx": "Lists all predictions with filtering, sorting, and risk indicators. Handles data loading states and integrates premium and terms gates.",
  "frontend/src/pages/PricingPage.tsx": "Shows monthly and yearly subscription plans and handles Stripe checkout creation after validating authentication and terms acceptance.",
  "frontend/src/pages/SendSupportPage.tsx": "Displays Cash App support information with copy-to-clipboard functionality and external link to Cash App profile. Encourages user donations.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service page with scrollable legal text, tracks acceptance via state, and saves acceptance to localStorage with toast notifications.",
  "frontend/src/utils/riskTier.ts": "Converts a prediction's winningProbability into a labeled risk tier with associated colors and descriptions.",
  "frontend/src/utils/termsAcceptance.ts": "Provides helpers to read, write, and clear a terms-acceptance flag in localStorage with timestamps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container settings, animations, and custom cash-themed variables.",
  "project_state.json": "Tracks the project’s state, requirements, existing features, and architectural notes for the sports predictions app."
}