{
  "backend/main.mo": "Motoko actor defining types, premium/subscription logic, prediction data structures, and persistent state maps for users, predictions, referrals, and scores.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in updating prediction refresh intervals and related gating behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and recent changes.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point providing a root div and loading the React application.",
  "frontend/src/App.tsx": "Main React app configuring routes and layout using TanStack Router and ThemeProvider.",
  "frontend/src/components/AccountProfileEditor.tsx": "Form component allowing users to edit and save their profile name and email.",
  "frontend/src/components/AdminGate.tsx": "Wrapper component that checks admin status and blocks access for non-admin users.",
  "frontend/src/components/AdminSupportCard.tsx": "Admin tool for looking up a user's premium status by Principal ID with detailed source descriptions.",
  "frontend/src/components/AppFooter.tsx": "Renders the site footer with branding, navigation links, social icons, and dynamic year plus a referral link. Uses responsive layout and styling.",
  "frontend/src/components/AppHeader.tsx": "Implements a responsive header with navigation, authentication state handling, admin links, and a mobile menu toggle. Integrates login button and routing.",
  "frontend/src/components/AppLayout.tsx": "Provides the overall page layout including header, footer, and conditional profile-setup modal. Detects authentication and user profile state to trigger setup flow.",
  "frontend/src/components/DabbleFormatCard.tsx": "Generates a formatted text block for Dabble betting entry based on a prediction and supports clipboard copying. Displays risk tier, confidence, and market details.",
  "frontend/src/components/HeroBranding.tsx": "Displays a hero section with branding imagery, gradients, and marketing text for AI-powered sports predictions. Serves as the landing page visual header.",
  "frontend/src/components/LiveScoreInline.tsx": "Shows a compact inline live score with status badges and team scores. Supports live, final, and other game states.",
  "frontend/src/components/LiveScorePanel.tsx": "Renders a detailed live score card with status, team blocks, period info, and last-updated timestamp. Handles loading and missing-score states.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout via Internet Identity with loading states and error recovery. Clears cached queries on logout and displays appropriate UI icons.",
  "frontend/src/components/ManualPremiumGrantCard.tsx": "Admin card allowing manual grant or revoke of premium access by Principal ID with validation and toast messages.",
  "frontend/src/components/PredictionsFilters.tsx": "UI filters for predictions list enabling sport selection and sort order changes.",
  "frontend/src/components/PremiumGate.tsx": "Gate component that restricts content to authenticated users with active premium access or admins.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter name and optional email, submitting profile data via API.",
  "frontend/src/components/RedeemReferralCodeCard.tsx": "Card for users to enter and redeem referral codes, handling validation and backend error mapping.",
  "frontend/src/components/ReferralCodesAdminPanel.tsx": "Admin panel to create, list, copy, and revoke referral codes with duration configuration.",
  "frontend/src/components/ResponsibleGamblingDisclaimer.tsx": "Static disclaimer alert warning users about betting risks and responsible gambling guidance.",
  "frontend/src/components/StripePaymentSetup.tsx": "Admin form to configure Stripe secret key and allowed countries for subscription payments.",
  "frontend/src/components/SubscribeCta.tsx": "CTA prompting users to view pricing and subscribe to unlock premium prediction content.",
  "frontend/src/components/TermsAcceptanceGate.tsx": "Component that blocks access until the user accepts terms, showing a summary, checkbox, and navigation to full terms.",
  "frontend/src/hooks/useActivateSubscription.ts": "Mutation hook that activates a subscription and refreshes all premium-related queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin utilities for checking admin status and mutating depth charts, injuries, coaching styles, news flags, and predictions.",
  "frontend/src/hooks/useAdminPremiumDiagnosis.ts": "Query hook for admins to run premium-access diagnostics on a target principal with error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity login, logout, and identity state.",
  "frontend/src/hooks/useLiveScores.ts": "Hooks to fetch live scores and games in progress with periodic refetching.",
  "frontend/src/hooks/useManualPremiumGrant.ts": "Mutation hook for admins to grant manual premium access and refresh related queries.",
  "frontend/src/hooks/useManualPremiumRevoke.ts": "Mutation hook for admins to revoke manual premium access and refresh related queries.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for retrieving predictions, including by sport and by ID.",
  "frontend/src/hooks/useReferralCodes.ts": "Hooks for listing, creating, revoking, and redeeming referral codes with cache updates.",
  "frontend/src/hooks/useRestorePremiumAccess.ts": "Mutation hook that forces refresh of subscription and premium status queries.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides hooks to create Stripe checkout sessions, check Stripe configuration, and set payment settings via an actor API.",
  "frontend/src/hooks/useSubscription.ts": "Fetches subscription, profile, and premium status and derives access flags and loading state.",
  "frontend/src/hooks/useUserProfile.ts": "Exposes hooks to fetch and update the current user's profile using react-query and actor calls.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, gradients, and custom utility classes for the app's styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AccountPage.tsx": "Displays user account details, subscription info, profile editing, and admin indicators with loading and auth handling.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for Stripe setup, data management, and prediction creation with various mutation handlers.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showcasing product features and pricing with branding components and marketing sections.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles subscription activation after successful payment, including auth checks, error states, and session parameter persistence.",
  "frontend/src/pages/PredictionDetailPage.tsx": "Shows detailed information for a single prediction, including live scores, metadata, and risk analysis.",
  "frontend/src/pages/PredictionsPage.tsx": "Lists predictions with filtering, sorting, and live score integration, gated behind premium and terms checks.",
  "frontend/src/pages/PricingPage.tsx": "Displays subscription plans and initiates Stripe checkout after validating authentication and terms acceptance.",
  "frontend/src/pages/SendSupportPage.tsx": "Provides Cash App details for sending creator support with copy-to-clipboard and external link options.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service page with scrollable legal text and tracks whether the user has accepted the terms using localStorage. Provides UI for accepting terms and displays toast notifications on errors or success.",
  "frontend/src/utils/refetchIntervals.ts": "Defines shared React Query refetch intervals for predictions (30 minutes) and live scores (1 second).",
  "frontend/src/utils/riskTier.ts": "Maps a prediction’s winning probability to a risk tier with associated labels, descriptions, and UI color settings. Returns structured tier data for display.",
  "frontend/src/utils/termsAcceptance.ts": "Manages reading, writing, and clearing terms-acceptance data in localStorage. Stores acceptance status and timestamp.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for extracting URL parameters, persisting them in sessionStorage, and removing them from the URL hash. Handles both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and theme extensions tailored to the app’s branding.",
  "project_state.json": "Describes the project’s current architecture, features, constraints, and known issues for the sports predictions app including subscriptions, AI picks, disclaimers, and real-time data."
}