{
  "kind": "build_request",
  "title": "Make the app fit the page and use a more vibrant cash-themed background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Update the global app layout background so it better fills the page and reads as a more vibrant cash theme (greens + gold accents), while keeping content readable in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make it fit to page more vibrant cash theme background"
        ]
      },
      "acceptanceCriteria": [
        "Across all routes rendered inside AppLayout, the background visually extends to the full viewport height (no unintended blank bands above/below content).",
        "The background uses a more vibrant cash-themed treatment (e.g., richer green/gold gradient accents) without reducing text contrast or legibility on cards and primary text.",
        "The background remains consistent between pages (Landing, Pricing, Predictions, Account, Admin, Terms, Support, Payment Success/Failure).",
        "Light mode and dark mode both remain usable: body text, headings, and key UI surfaces meet clear contrast against the background."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Adjust the cash-themed pattern/gradient usage on the landing hero so it looks more vivid and better integrated with the rest of the page background (using the existing generated pattern asset).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make it fit to page more vibrant cash theme background"
        ]
      },
      "acceptanceCriteria": [
        "HeroBranding continues to use /assets/generated/cash-pattern.dim_2048x2048.png, but with updated opacity/overlay/gradient so the effect is noticeably more vibrant while still subtle enough for readability.",
        "The hero background transitions smoothly into the rest of the page background (no harsh edge where the hero ends).",
        "No layout overflow is introduced (no unintended horizontal scroll on mobile or desktop)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (compose existing hooks/components instead).",
    "Do not add any backend changes for this request."
  ],
  "nonGoals": [
    "Do not change pricing, subscription logic, referral code logic, predictions logic, or Terms/Disclaimer content.",
    "Do not introduce new authentication methods or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}