{
  "kind": "build_request",
  "title": "Change predictions auto-refresh cadence to every 30 minutes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Update the Predictions list page to refresh predictions data every 30 minutes (instead of the current 10-second interval) while keeping existing premium gating and terms gating behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use ai tools to make predictions based on dabble. Update predictions every 30 min"
        ]
      },
      "acceptanceCriteria": [
        "When viewing /predictions, the predictions queries use a 30-minute refetch interval (1,800,000 ms) rather than 10,000 ms.",
        "PremiumGate and TermsAcceptanceGate behavior on /predictions is unchanged (users without required access are still blocked appropriately).",
        "Live score polling remains at its existing cadence and continues to update independently of predictions refresh."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Update the Prediction detail page to refresh the selected prediction data every 30 minutes (instead of the current 10-second interval) while keeping existing premium gating, terms gating, and live score updates unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update predictions every 30 min"
        ]
      },
      "acceptanceCriteria": [
        "When viewing /predictions/$id, the prediction query uses a 30-minute refetch interval (1,800,000 ms) rather than 10,000 ms.",
        "The live score panel continues to update at its existing cadence and is not slowed down by the prediction refresh change.",
        "All user-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep Internet Identity as the authentication mechanism; do not add third-party auth.",
    "Do not add any Dabble API integration; continue using the existing Dabble-aligned formatting approach."
  ],
  "nonGoals": [
    "Changing the prediction-generation/scoring model logic or adding new prediction factors beyond what already exists.",
    "Implementing real-time prediction regeneration on the backend; this change is limited to the client-side refresh cadence for fetching predictions.",
    "Changing live-score polling cadence (it should remain as-is)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}